# Ex3 - Getting and Knowing your Data

This time we are going to pull data directly from the internet.
Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users and use the 'user_id' as index

In [2]:
users  = pd.read_csv("Occupation.csv", sep = "|", index_col= "user_id")
users.head(1)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711

### Step 4. See the first 25 entries

In [3]:
users.head(1)

         age gender  occupation zip_code
user_id
1         24      M  technician    85711

### Step 5. See the last 10 entries

In [4]:
users.tail(1)

         age gender occupation zip_code
user_id
943       22      M    student    77841

### Step 6. What is the number of observations in the dataset?

In [5]:
users.shape

(943, 4)

### Step 7. What is the number of columns in the dataset?

In [6]:
len(users.columns)

4

### Step 8. Print the name of all the columns.

In [7]:
for i in users.columns:
    print(i)

age
gender
occupation
zip_code

### Step 9. How is the dataset indexed?

In [8]:
users.index

Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
       ...
       934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
      dtype='int64', name='user_id', length=943)

### Step 10. What is the data type of each column?

In [9]:
users.info()

<class 'pandas.core.frame.DataFrame'>
Index: 943 entries, 1 to 943
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   age         943 non-null    int64
 1   gender      943 non-null    object
 2   occupation  943 non-null    object
 3   zip_code    943 non-null    object
dtypes: int64(1), object(3)
memory usage: 36.8+ KB

### Step 11. Print only the occupation column

In [10]:
users["occupation"].head(2)

user_id
1    technician
2         other
Name: occupation, dtype: object

### Step 12. How many different occupations are in this dataset?

In [11]:
users.occupation.nunique()

21

### Step 13. What is the most frequent occupation?

In [12]:
users.occupation.value_counts().sort_values(ascending = False).head(1)

occupation
student    196
Name: count, dtype: int64

### Step 14. Summarize the DataFrame.

In [14]:
users.describe()

              age
count  943.000000
mean    34.051962
std     12.192740
min      7.000000
25%     25.000000
50%     31.000000
75%     43.000000
max     73.000000

### Step 15. Summarize all the columns

In [16]:
users.describe(include = "all")

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

### Step 16. Summarize only the occupation column

In [17]:
users.occupation.describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

### Step 17. What is the mean age of users?

In [18]:
users.age.mean()

34.05196182396607

### Step 18. What is the age with least occurrence?

In [19]:
users.age.value_counts().tail()

age
7     1
66    1
11    1
10    1
73    1
Name: count, dtype: int64